# **Задание 3.** Напишите приложение, которое работает с заметками
# Приложение должно создавать, читать, редактировать и удалять заметки.
# Для этого создайте функции для каждой операции с
# заметками и основную функцию, которая управляет работой приложения.

import os
import logging
logging.basicConfig(level=logging.INFO)

def build_note(note_text, note_name):
    """получает название и текст заметки, а затем создает текстовый файл с этим названием и текстом"""
    if not note_text.strip():
        logger.error("Текст заметки не может быть пустым.")
        return
    with open(f"{note_name}.txt", "w", encoding="utf-8") as file:
        file.write(note_text)
    logger.info(f"Заметка {note_name} создана.")


def create_note():
    """запрашивает у пользователя название и текст заметки, а затем вызывает функцию build_note(note_text, note_name)"""
    note_name = input("Введите название заметки для создания: ")
    note_text = input("Введите текст заметки: ")
    build_note(note_text, note_name)


def read_note():
    """запрашивает у пользователя название заметки. Если файл с таким названием существует, функция считывает содержимое
    файла и выводит его на экран. Если файла не существует, функция выводит сообщение, что заметка не найдена.
    Для проверки наличия файла используйте функцию os.path.isfile из модуля os.
    Не забудьте импортировать этот модуль."""
    note_name = input("Введите название заметки: ")
    if os.path.isfile(note_name + ".txt"):
        with open(f"{note_name}.txt", "r", encoding="utf-8") as file:
            print(file.read())
        return note_name
    else:
        logger.error("Заметка не найдена.")
        return ''



def edit_note():
    """запрашивает у пользователя название заметки. Если файл с введенным именем существует, функция считывает и выводит
     содержимое файла, запрашивает у пользователя новый текст заметки и обновляет содержимое файла. Если файла не
      существует, она выводит сообщение, что заметка не найдена."""
    note_name = read_note()
    if note_name != '':
        note_text = input("Введите новый текст заметки: ")
        with open(f"{note_name}.txt", "w", encoding="utf-8") as file:
            file.write(note_text)
        logger.info(f"Заметка {note_name} обновлена.")


def delete_note():
    """запрашивает у пользователя название заметки. Если файл с введенным именем существует, функция удаляет файл.
    Для удаления используйте функцию os.remove из модуля os. Если файла не существует, она выводит сообщение,
    что заметка не найдена."""
    note_name = input("Введите название заметки для удаления: ")
    if os.path.isfile(note_name + '.txt'):
        os.remove(note_name + '.txt')
        logger.info(f"Заметка {note_name} удалена.")
    else:
        logger.error("Заметка не найдена.")


def main():
    """содержит основной цикл программы. Функция отображает меню с вариантами действий с заметками, которые пользователь
     может выбрать. Затем функция выполняет действие, которое выбрал пользователь."""

    while True:
        # запрашиваем дейстие с заметкой у пользователя
        sel = input("Что вы хотите сделать с заметкой?\n"
                    "Создать       - 1\n"
                    "Читать        - 2\n"
                    "Редактировать - 3\n"
                    "Удалить       - 4\n"
                    ":> ")
        # выполнение действий с заметками
        if sel == "1":
            create_note()
        elif sel == "2":
            read_note()
        elif sel == "3":
            edit_note()
        elif sel == "4":
            delete_note()
        else:
            logger.info('Не верно введен вариант действия с заметклй.')

        # выход из программы
        if input('Продолжить работу с заметками (y/n)?\n:> ').lower() == 'n':
            break


if __name__ == "__main__":
    logger = logging.getLogger(__name__)
    main()
